//#include <iostream>
//using namespace std;
//int main()
//{
//	//指针和数组
//	//利用指针访问数组中元素
//
//	int arr[] = { 1,2,3,4,5,6,7,8,9,10 };
//
//	int* p = arr;//数组名arr是数组首地址
//
//	cout << "利用指针来访问第一个元素" << * p << endl;
//
//	p++;
//	//指针32位占4个字节，整型数组一个元素4个字节，指针向后移一位访问第二个元素
//	cout << "利用指针来访问第二个元素" << * p << endl;
//
//	cout << "利用指针遍历数组" << endl;
//	
//	int* p2 = arr;
//	for (int i = 0; i < 10; i++)
//	{
//		cout << "第" << i+1 << "个元素为" << * p2 << endl;
//		p2++;
//	}
//
//
//
//
//
//
//
//	return 0;
//}