//#include <iostream>
//using namespace std;
//int main()
//{
//	//数组
//	/*1. 数据类型 数组名[数组长度];
//	2. 数据类型 数组名[数组长度] = { 值1，值2 ... };
//	3. 数据类型 数组名[] = { 值1，值2 ... };*/
//
//
//	//1. 数据类型 数组名[数组长度];
//	int arr1[5];
//	arr1[0] = 10;
//	arr1[1] = 20;
//	arr1[2] = 30;
//	arr1[3] = 40;
//	arr1[4] = 50;
//
//	//循环输出
//	for (int i = 0; i < 5; i++)
//	{
//		cout << arr1[i] << endl;
//	}
//
//
//	//2. 数据类型 数组名[数组长度] = { 值1，值2 ... };
//	int arr2[5] = { 1,2,3,4,5 };
//
//	cout << arr2[0] << endl;
//	cout << arr2[1] << endl;
//	cout << arr2[2] << endl;
//	cout << arr2[3] << endl;
//	cout << arr2[4] << endl;
//
//
//	//3. 数据类型 数组名[] = { 值1，值2 ... };
//	int arr3[] = { 100,200,300,400,500 };
//	
//	for (int j = 0; j < 5; j++)
//	{
//		cout << arr3[j] << endl;
//	}
//
//
//	return 0;
//}