//#include <iostream>
//using namespace std;
//
//int main()
//{
//
//	//算数运算符-递增递减
//	//1.前置递增
//	int a = 10;
//	++a;
//	cout << "a=" << a << endl;
//
//	//2.后置递增
//	int b = 10;
//	b++;
//	cout << "b=" << b << endl;
//
//	//二者区别
//	//前置递增，先+1，再进行表达式运算
//	
//	int c = 10;
//	int d = ++c * 10;//先将c+1，再用计算结构*10
//	cout << "c=" << c << endl;//11
//	cout << "d=" << d << endl;//110
//
//	//后置递增，先进行表达式运算，后+1
//	int c1 = 10;
//	int d1 = c1++ * 10;//先将c1原值*10，赋给d1，再让c1++
//	cout << "c1=" << c1 << endl;//11
//	cout << "d1=" << d1 << endl;//100
//	
//
//	//前置递减
//	int c2 = 10;
//	int d2 = --c2 * 10;//先将c2-1，再用计算结构*10
//	cout << "c2=" << c2 << endl;//9
//	cout << "d2=" << d2 << endl;//90
//
//
//	//后置递减
//	int c4 = 10;
//	int d4 = c4-- * 10;//先将c2*10，再--
//	cout << "c4=" << c4 << endl;//9
//	cout << "d4=" << d4 << endl;//100
//
//	return 0;
//}